[
{"class":"br.edu.ifsp.pds.shadowstruggles.model.Scene","id":0,"nextId":1000,"name":"Confrontos Sombrios","script":"Vá além das nuvens e estrelas acima, viaje através da terra e do magma abaixo, transcendendo ambos tempo e espaço. Uma vez lá, você irá encontrar um lugar aonde nem 'vida' ou 'matéria' possuem significados expressivos. A única realidade é aquela da interminável oposição entre duas facções.

'Luz' e 'Trevas' ou 'Bem' e 'Mal' é como os mortais compreendem estas entidades etéreas, mas isto só se deve às suas próprias existências limitadas. O universo tão precioso deles é nada a não ser uma pequena mancha, resíduo da guerra. Uma sombra indesejada.

No momento que Luz e Trevas se deram conta de tal existência, a sombra já havia crescido significativamente. Admirados, eles decidiram entreter-se e tentar resolver o conflito de maneira diferente, através daquele novo brinquedo divertido. Então, a Luta das Sombras começou.",
"language":"pt_br",
"backgroundImage":"data/images/scenes/light_darkness_2.png",
"backgroundMusic":"intro",
"choices":[]
},

{"class":"br.edu.ifsp.pds.shadowstruggles.model.Scene","id":1000,"nextId":2000,"name":"O Começo","script":"Nos encontramos numa situação bem peculiar.

Auxiliados pelas maravilhas da alquimia, os habitantes de determinado planeta decidiram que era tempo de expandir seus horizontes, mover-se além do que suas experiências limitadas poderiam compreender. E assim começou um novo e excitante capítulo para eles, cheio de mistérios, descobertas, conhecimento, blah blah, e assim por diante. Realmente não importa, já que esta história não tem nada a ver com isso.  

Os alquimistas e algumas famílias escolheram permanecer no planeta, vivendo uma vida pacífica e apreciando seus lares o máximo que podiam. Eles eram bem sucedidos, pelo menos até uma raça alienígena chegar de repente e proclamar controle sobre o território. E hoje este é o nosso tópico principal.

Caso você esteja se perguntando, o nome do planeta é Terra, mas isto não deve ser muito importante.

Mais de uma década após a invasão na Terra a pesquisa alquimista é mais intensa do que nunca, com o fim de ampliar o poder militar alien. O jovem aprendiz Lockstar está prestes a continuar seu treinamento sob a tutela de Phoenix, embora não no sentido que ele esperava: é um treinamento de batalha. De acordo com Phoenix, é importante para um alquimista saber se defender e lidar com diferentes situações... Além disso, alguém teria que usar aqueles robôs pelo menos uma vez.",
"language":"pt_br",
"backgroundImage":"data/images/maps/cena1.png",
"backgroundMusic":"intro",
"choices":[]
 },
 
 {"class":"br.edu.ifsp.pds.shadowstruggles.model.Scene","id":2000,"nextId":3000,"name":"Mestre e discípulo","script":"After an overly long day of bothersome activities, Lockstar finally finds time to rest under a rotten tree. As if having read his pupil's thoughts, Phoenix approaches him and casually begins to speak:

- As far as I know, you were the one who chose me, weren't you? No complaints now.

Indeed, Lockstar knew very well of Phoenix' fame even before enrolling in the academy. An elite among elite, the professor is revered and feared by humans and even aliens from all over the world, alchemists or not. One would expect him to be a strict teacher, and would be correct. But that's not the end of it.

Phoenix is actually quite passionate about human development, to a point of deciding his students' schedules, living with them under the same roof and completely crossing the line of what's acceptable in a normal academic relationship in general.

- You are correct, sir - Lockstar says -. I want to become the best alchemist I can, to penetrate the secrets, to master the art of transformation, to...

- Don't get any funny ideas now, sparky dog. In case you've forgotten, we are Specialists. We build things, we destroy things, we fix things. Fantasizing about the 'magical power of alchemy' is for those rotten relics who call themselves Orthodoxies. Frankly, they make us serious alchemists look like idiots who know nothing about scientific method. But how could that be true, if everything we have today, including space exploration, is thanks to alchemy, huh? Why doesn't anyone try to answer that?

As a matter of fact, Phoenix himself has answered these questions countless times on many essays. He was also the one who coined the pejorative term 'Orthodoxies' to designate theorists and philosophers of alchemy, and now this is their usual denomination. Since everyone calls them that way, Orthodoxies see no choice but to accept it.

Despite having to do the impossible to deal with Phoenix and his ferocity, Lockstar has never once doubted: he was on the right path towards a brilliant future. Even when his master seemed desperate about something, he knew it was because of Phoenix' natural dedication, and respected him for this.

Nothing will ever change, he won't allow it. As an alchemist, he will be the one to trigger any kind of transformation. He is the master, not the slave.",
"language":"en_us",
"backgroundImage":"data/images/scenes/sunset.png",
"backgroundMusic":"intro",
"choices":[]
 }
 ]